Tekla Open API Reference for Tekla Structures 2025
Picker.PickObjects Method (Picker.PickObjectsEnum, String)
 Queries the user to pick model objects from the model with the given prompt.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator PickObjects(
	Picker.PickObjectsEnum Enum,
	string Prompt
)
Public Function PickObjects (
	Enum As Picker.PickObjectsEnum,
	Prompt As String
) As ModelObjectEnumerator
Parameters
Enum
Type: Tekla.Structures.Model.UI.Picker.PickObjectsEnum
Indicates the type and amount of objects to pick.
Prompt
Type: System.String
The string to display as user guidance.
Return Value
Type: ModelObjectEnumerator
An enumerator of model object instances.
See Also
Reference
Picker Class
PickObjects Overload
Tekla.Structures.Model.UI Namespace